Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F34B.tmx
Source language: en_us
Languages: zh_cn

source: A place where I am real
zh_cn: 芬兰：一个让我感到真实的地方

source: Every place you leave becomes a memory.
zh_cn: 你离开的每一处都将成为一段回忆。

source: Even if you return to visit, in your mind it's as it was when you left, slowly fading until only the structure, the broadest outline, remains.
zh_cn: 即使当你重返故地，你当日离去的情形也仍映在你脑海，缓慢散去，直到仅剩结构和最宽泛的轮廓。

source: The longer you're gone, the more your mind fills the spaces with dreams; until they, too, become memories and fade.
zh_cn: 你离开的越久，你的脑海中的幻想就越多，直到这些幻想也终于变成回忆，褪去。

source: It takes time to get there: it's been two years since I came to Helsinki, and while I have already forgotten my confusion at street names and have no memory whatsoever of The Time Before I Owned Rain Boots, in my mind the structure of it is still forming.
zh_cn: 重游故地已是很久之后：距离我上次到赫尔辛基已有两年了。我早已忘了那些曾经困惑过我的街名，也不记得任何有关我得到“雨鞋”之前的时光，在我印象中，那段日子却依稀可见。

source: There are stages of adjustment to a new place - from loving all the new to hating just about everything - but feeling settled can take a while.
zh_cn: 这是到达新地方的适应过程——从对所有新鲜事物的热爱到单纯的憎恨所有——但是安定的感觉一直持续。

source: Some stubbornly cling to the place they used to call home.
zh_cn: 这种对一个地方某种顽固的眷恋就是传说中的家。

source: That was me for a while.
zh_cn: 那一度是曾经的我。

source: I consider New York City my adopted hometown.
zh_cn: 我以为纽约是我的故乡，我成长的地方。

source: You fight your way into NYC.
zh_cn: 努力打拼，以你的方式融入纽约。

source: It isn't easy. It isn't cheap.
zh_cn: 这并不容易，也并非毫无代价。

source: It isn't particularly friendly, at least until you're used to a four-letter word as part of a compliment.
zh_cn: 纽约并不是特别友好的城市，至少只有当你已经习惯四个字节单词赞美的时候才会改变主意。

source: So when I got to Helsinki, I was suspicious at how easy it was (aside from the street names).
zh_cn: 所以当我来到赫尔辛基，我对这个城市的简单感到怀疑（除了街道名字）。

source: People were friendly. And nice.
zh_cn: 人们很友好，且和善。

source: Curious about what I thought of Finland.
zh_cn: 对我为什么想到芬兰感到好奇。

source: Aside from the coffee and the cost of living, Helsinki and New York don't have much in common; but I was born in the US Midwest, which was heavily influenced by Nordic immigrants, so as foreign as it was, parts of Finnish life seemed familiar.
zh_cn: 除了咖啡和生活成本，赫尔辛基和纽约并无太多相似之处。不过我出生在美国中西部，那儿受北欧移民影响很深，所以作为一个芬兰的外国人，芬兰生活的某些方面似曾相识。

source: Still, I missed New York.
zh_cn: 我仍然想念纽约。

source: I visited last year, and I went to my old coffee cart, still in the same place.
zh_cn: 我去年回到纽约，来到属于我的咖啡座，还是同样的地方。

source: Although it was 2013, my mind insisted that it was 2007 and I had never left.
zh_cn: 尽管那时是2013年，我的思维仍然停留在2007年，仿佛我从未离开。

source: He looked at me with a glimmer of recognition, silently reaching for the same size cup and pouring the same type of coffee I always got.
zh_cn: 他看了看我，似乎记得我，默默的为我端上杯子，倒上咖啡，一样的尺寸，一样的咖啡，一如既往。

source: Same corner, same guy, same coffee: this was my turf. I belonged.
zh_cn: 同样的角落，同样的人，同样的咖啡。我的天地。我的归属。

source: Or, I did: for as cities change, bit by bit, day by day, so slowly that they always seem the same, when you close your eyes for six years, even if everything looks the same when you open them, it isn't.
zh_cn: 然而，我错了：因为城市会改变，一点一点，一天一天，如此缓慢以至于看不出有什么变化。当你闭上双眼，六年之后，你再睁开，甚至没有一样事物改变。而纽约不是这样。

source: The slang is almost imperceptibly different; there are references to a TV show I've never seen.
zh_cn: 俚语几乎完全不同；电视里播放着我从未看过的节目。

source: To the coffee guy, maybe I moved to a different neighborhood; he wouldn't guess from my appearance that I haven't even been in the country.
zh_cn: 对于咖啡小弟而言，可能他认为我只是搬到了另一个街区；他无法从我的外表判断出我曾离开过这个国家。

source: It wasn't until I opened my mouth that he twigged that there was something different.
zh_cn: 直到我了开了口，他才意识到些许的不同。

source: It was something I said, I'm sure.
zh_cn: 我知道是我的谈吐引起了他的注意。

source: He lumped me with the faceless mass of tourists who got lost on their way from Times Square, pushed my change across the counter and turned away.
zh_cn: 他把我当成千万名来纽约旅行并在时代广场迷路的游客一员，我的改变被推到墙角转向而行。

source: It's better than the truth, which is that I was the person that he recognised - but not a person, so much as an apparition from seven years ago.
zh_cn: 他认识我，这样对他来说就足够了，不需要七年之久。

source: In my mind, this was home.
zh_cn: 在我脑海里，这里是曾经的故乡。

source: It was the place I saw when I dreamt of my childhood, long after I left it; and now I am the same as the gaggle of tourists with M&M Store bags.
zh_cn: 我儿童时代的梦想之地，很久之后我又离开；现在我又成了一名过客，跟那些叽叽喳喳拿着M&M 包装袋的旅客没什么不同。

source: So I get back on the plane to Finland - where I have a new coffee guy, who knows my name and smiles when he sees me - watching the Manhattan skyline far in the distance, just another set of twinkling lights set against the fading sun.
zh_cn: 所以我搭上了回芬兰的航班——那儿有新的咖啡小弟，知道我的名字，看到我时对我微笑——看着曼哈顿遥远的天际线犹如另一组闪烁的微光反抗消匿中的太阳。

source: I'm leaving the ghost behind to return to a place where I'm real, and that is itself changing, bit by bit, day by day.
zh_cn: 我将旧梦抛在脑后，回到属于我的地方，那里正在改变，一点一点，一天一天。
